{
  "banners": [
    {
      "verticalTitle": "Работа с нами",
      "imageUrl": "/images/jpg/Ban/ban1.jpg",
      "paragraphs": [
        "Группа компаний ЭНЕРГОМИКС",
        "Осуществляем оптовые продажи для юридических лиц"
      ],
      "listItems": [
        "С 1998 года на рынке России.",
        "Широкий ассортимент — Более 500 000 товаров от ведущих производителей.",
        "96 представительств и свыше 3630 партнеров.",
        "Развитая логистическая сеть — 10 собственных логистических центров обеспечивают быструю доставку в 83 регионах страны.",
        "Гибкость в ценообразовании — готовы обсуждать цены и находить оптимальные решения."
      ],
      "closingParagraph": "Присоединяйтесь к числу наших партнеров и ощутите все преимущества сотрудничества с ЭНЕРГОМИКС!"
    },
    {
      "verticalTitle": "Технологии",
      "imageUrl": "/images/jpg/Ban/ban1.jpg",
      "paragraphs": [
        "Мы постоянно внедряем автоматизированные конвейерные системы и автоматизации на складах, что позволяет повышать эффективность операций и снижать издержки.",
        "Подключите API REST для обмена данными: <span data-tab-url=\"/pages/resapi.html\" data-open-tab=\"true\" data-tab-title=\"Инструкция\">Инструкция</span><br />Убедитесь, что ваша номенклатура, остатки и цены на наших ресурсах всегда актуальны.",
        "API REST — это простой способ автоматизировать обмен данными и сделать информацию доступной для ваших клиентов в любое время.",
        "Мы упрощаем документооборот, обеспечивая быстрое и удобное оформление всех необходимых документов."
      ]
    },
    {
      "verticalTitle": "Как стать клиентом",
      "imageUrl": "/images/jpg/Ban/ban1.jpg",
      "paragraphs": [
        "Здесь вы найдёте чёткую пошаговую инструкцию по регистрации и условиям сотрудничества: «как стать клиентом», «где найти нужные вкладки».",
        "Как оформить заказ?"
      ]
    },
    {
      "verticalTitle": "Наши ресурсы",
      "imageUrl": "/images/jpg/Ban/ban1.jpg",
      "paragraphs": [
        "Для вашего удобства созданы отдельные ресурсы:",
        "Наши контакты"
      ],
      "listItems": [
        "Наш информционный портал: <a href=\"https://energomix.ru/\" target=\"_blank\" rel=\"noopener noreferrer\">energomix.ru</a>.",
        "Покупка в розницу для наших партнеров на сайте: <a href=\"https://1-2.sale/\" target=\"_blank\" rel=\"noopener noreferrer\">1-2.sale</a>.",
        "Скачайте актуальные прайс-листы по ссылке: <span data-tab-url=\"/pages/price.html\" data-open-tab=\"true\" data-tab-title=\"Прайс\">Прайс-листы</span>",
        "Поддержка и консультации: наши специалисты всегда готовы помочь вам! В нашем чате предусмотрены быстрые ответы на все типовые вопросы по взаимодействию с сайтом и компанией. <span data-open-tab=\"true\" data-tab-title=\"Чат\" data-tab-url=\"/pages/chat.html\">Перейти в чат</span>."
      ]
    },
    {
      "verticalTitle": "Журнал «Энергомикс»",
      "imageUrl": "/images/jpg/Ban/ban1.jpg",
      "paragraphs": [
        "Платформа для обмена опытом, новостями и аналитикой. В каждом выпуске вы найдете актуальные статьи о последних тенденциях рынка, новинках и полезных советах для бизнеса. Мы делимся историями успеха наших партнеров и сотрудников, вдохновляющими примерами и кейсами, которые помогут вам развивать свой бизнес.",
        "Кроме того, журнал освещает текущие и планируемые маркетинговые мероприятия ГК ЭНЕРГОМИКС, предоставляя эксклюзивные материалы, интервью с лидерами компании и глубокую аналитику. Подпишитесь на журнал Энергомикс и оставайтесь в курсе всех новостей и событий нашей компании!",
        "<span data-tab-url=\"/pages/magazin.html\" data-open-tab=\"true\" data-tab-title=\"Наш журнал\">Наш журнал</span>"
      ]
    }
  ]
}
